w6/w6d3/First_Route_Controllers/first_routes/app/controllers/artworks_controller.rb

    def index
        if params[:user_id]
            user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        artwork = Artwork.new(artwork_params)
        # replace the `artwork_attributes_here` with the actual attribute keys
        if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Magic Carpet"], ["image_url", "agrabah.com"], ["artist_id", 2], ["created_at", "2021-02-25 23:36:33.841030"], ["updated_at", "2021-02-25 23:36:33.841030"]]