w6/w6d3/First_Route_Controllers/first_routes/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("username") VALUES (?)  [["username", "jug"]]

    def update
       user = User.find_by(id: params[:id])
        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ? WHERE "users"."id" = ?  [["email", "stuff@fake_trees.com"], ["id", 1]]